In [1]:
%matplotlib inline
#'%' required for formatting
import sqlite3 as sql
import pandas as pd
import matplotlib as plt

# POC of SQLAlchemy ORM for AIS

## Scoping our POC

### Creating Employee Offices object combining employees and offices

Starting from object defined by use case, i.e. 
* Business Question: I am an admin and I want to know which offices an employee is located
* Acceptance Criteria:
    * Given name of employee return all employees and office details matching name
    * Specific details:
      * Office: City; Phone; Address; State; ZIP
      * Employee: First Name; Last Name; Employee Number

Also consider other functionality not include in this version or feature.
Use this list to store ideas while developing, that way ideas are kept but do not derail the original task
We store these ideas for later so it is typically called an 'ice box'
* Known Exceptions / Exclusions (i.e. "Ice Box"):
 *  Spell check, case insensitivity, fuzzy match employee names
 *  Identify active vs inactive employees and/or office locations
 *  Employee address information
 *  Access controls

## Background Information

In [5]:
# Tradional connection protocal for exploratory / informative tables
conn = sql.connect('./classicmodels.db')

In [6]:
#Write query to show tables. We read a meta data master file and get the names
qry = "SELECT name FROM sqlite_master WHERE type='table';"

#pandas makes it easier to read the query using the connection
#will print automatically

pd.read_sql_query(qry,conn)

           name
0     customers
1     employees
2       offices
3  orderdetails
4        orders
5      payments
6  productlines
7      products

In [17]:
# Queries to show the data in the underlying tables first, for demostration only
#query to get first few office records from table
qry2 = 'select * from offices limit 10'
pd.read_sql_query(qry2,conn)

,officeCode,city,phone,addressLine1,addressLine2,state,country,postalCode,territory
0,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
2,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA
3,4,Paris,+33 14 723 4404,43 Rue Jouffroy Dabbans,None,None,France,75017,EMEA
4,5,Tokyo,+81 33 224 5000,4-1 Kioicho,None,Chiyoda-Ku,Japan,102-8578,Japan
5,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,None,Australia,NSW 2010,APAC
6,7,London,+44 20 7877 2041,25 Old Broad Street,Level 7,None,UK,EC2N 1HN,EMEA

In [18]:
#query to get first few employee records from table
qry3 = 'select * from employees limit 10'
pd.read_sql_query(qry3,conn)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
5,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056.0,Sales Manager (NA)
6,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143.0,Sales Rep
7,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1,1143.0,Sales Rep
8,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143.0,Sales Rep
9,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep

### Matching our acceptance criteria

Our first object should match what we are actually doing

The domain is a resource with our actor as an HR admin

Nameing convention on Classes typically is in Pascal Case, Methods in Camel

We will assume our domain is included in the Class Name for clarity

Notice we are explicitily stating the address as office, our requirements do not include the employees personal address. Why would we not want to include this information in a minimimal viable example such as this?

employeeResource:
- employeeID
- firstName
- lastName
- officeAddressLineOne
- officeAddressLineTwo
- officeState
- officeZIP

* Methods
    * employeeOfficeLocationsByName(self.firstName,self.lastName)

The last item is our method to return other values from the employeeResource object

This process is known as creating 'psuedo code' and is extremely helpful when translating business needs and coding. It should be done collaboratively with all stakeholders in order to enforce a consistent language among all involved in the product.

Although our low level table classes already be defined in most real-world situations, we will define them now through Automapping

See: 
* http://docs.sqlalchemy.org/en/latest/orm/extensions/automap.html#module-sqlalchemy.ext.automap
* https://www.pythonsheets.com/notes/python-sqlalchemy.html

In [1]:
# Define our base classes from table using current metadata
# Again, typically we define the schema

from sqlalchemy.orm import Session
from sqlalchemy.orm import sessionmaker
from sqlalchemy import *


#from sqlalchemy.ext.automap import declaritive
from sqlalchemy.ext.declarative import declarative_base

Base = declarative_base()

#dburi = "mysql+mysqlconnector://admin:admin@127.0.0.1:3306/classicmodels" #mysql
dburi = "sqlite:///classicmodels.db" #sqlite

engine = create_engine(dburi)

#Base = automap_base(metadata=metadata)
#Base = declarative_base(engine)

In [2]:
# Get metadata info from engine

#Use existing schema for demostration, define classes in practice 

Base.metadata.bind = engine

In [3]:
# Define our declaritive classes using the metadata info for simplicity

# Metadata bound to Base allows use to rename attributes (e.g. Tables and Columns) in our new base objects

class Offices(Base):
    __tablename__ = 'offices'
    __table_args__ = {'autoload': True}
    officecode = Column('officeCode', Integer, primary_key = True)

class Employees(Base):
    __tablename__ = 'employees'
    __table_args__ = {'autoload': True}
    officecode = Column('officeCode', Integer, ForeignKey('offices.officeCode'))
    employeeNumber = Column('employeeNumber', Integer, primary_key = True)

C:\ProgramData\Miniconda2\lib\site-packages\sqlalchemy\dialects\sqlite\base.py:1297: SAWarning: Could not instantiate type <class 'sqlalchemy.sql.sqltypes.INTEGER'> with reflected arguments [u'11']; using no arguments.
  (coltype, args))

In [16]:
# Makes a session object factory to create new sessions using our engine
# Please note, the engine and base are bound, so Base class info is retained in engine

Session = sessionmaker(bind=engine)

In [17]:
session = Session()

In [4]:
# Test query from employee object


employeeTest = session.query(Employees).filter(Employees.lastName=="Murphy").one()

In [5]:
print employeeTest.officecode

1

In [6]:
# This will return an error 'Employees' object has no attribute 'officeCode'
# Why?

print employeeTest.officeCode

AttributeError: 'Employees' object has no attribute 'officeCode'

In [63]:
session.close()

## Building the relationship

Now we have a functional map to our relational database, let's get our final object working

First we need to define the relationship between our two base objects

Again, this will already be defined in most cases, we are including it here for insight only

Reference: http://docs.sqlalchemy.org/en/latest/orm/tutorial.html#building-a-relationship

Note: Many-to-many handled by linkage table, easy to do in ORM once concept is understood, see: https://www.pythoncentral.io/sqlalchemy-orm-examples/ for more detail

In [6]:
import sqlite3 as sql
#import mysql.connector as sql
from sqlalchemy.orm import Session
from sqlalchemy.orm import sessionmaker
from sqlalchemy import *

#from sqlalchemy.ext.automap import declaritive
from sqlalchemy.ext.declarative import declarative_base

# Redefine our classes with relationship

from sqlalchemy.orm import relationship

# Overwrite our base and engine to eliminate collisions
# This is only for our exercise, is not used in real world situations

Base = declarative_base()

#dburi = "mysql+mysqlconnector://admin:admin@127.0.0.1:3306/classicmodels" #mysql
dburi = "sqlite:///classicmodels.db" #sqlite

engine = create_engine(dburi)

Base.metadata.bind = engine

In [7]:
# Populate the 'offices' relationship in our Employee object to the "Offices" object
# Employee.offices is the name of the relationship
# The primary key to foreign key defines the relationship between the tables

# Again, this will already be defined in a production setting

# Association table defines the relationship between the two tables
# Association table is a 'helper' table, is not defined as a class, but referenced using Base.metadata

employeeOfficeAssociation = Table('employeeOfficeAssociation',
                                  Base.metadata,
                                  Column('employeeNumber', Integer, ForeignKey('employees.employeeNumber')),
                                  Column('officeCode', Integer, ForeignKey('offices.officeCode'))
                                 )

class Employees(Base):
    __tablename__ = 'employees'
    __table_args__ = {'autoload': True}
    officecode = Column('officeCode', Integer, ForeignKey('offices.officeCode'))
    employeeNumber = Column('employeeNumber', Integer, primary_key = True)
    office = relationship('Offices', secondary=employeeOfficeAssociation, uselist = False)

class Offices(Base):
    __tablename__ = 'offices'
    __table_args__ = {'autoload': True}
    officecode = Column('officeCode', Integer, primary_key = True)

In [8]:
Session = sessionmaker(bind=engine)

session = Session()

In [9]:
empTest2 = session.query(Employees, Offices).filter(Employees.lastName=="Murphy").all()

In [10]:
for record in empTest2:
    print record.Offices.addressLine1

100 Market Street
1550 Court Place
523 East 53rd Street
43 Rue Jouffroy Dabbans
4-1 Kioicho
5-11 Wentworth Avenue
25 Old Broad Street

In [11]:
# Easier in Pandas

import pandas as pd

_query = session.query(Employees, Offices)\
                    .join(Offices, Employees.officecode == Offices.officecode)\
                    .with_labels()\
                    .statement #gives raw sql code

empTestDf = pd.read_sql(_query, session.bind) #will warn about duplicate names, can be ignored

In [12]:
empTestDf.head()

,employees_officeCode,employees_employeeNumber,employees_lastName,employees_firstName,employees_extension,employees_email,employees_reportsTo,employees_jobTitle,offices_officeCode,offices_city,offices_phone,offices_addressLine1,offices_addressLine2,offices_state,offices_country,offices_postalCode,offices_territory
0,1,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,NaN,President,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
1,1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1002.0,VP Sales,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
2,1,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1002.0,VP Marketing,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
3,6,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,1056.0,Sales Manager (APAC),6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,None,Australia,NSW 2010,APAC
4,4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,1056.0,Sale Manager (EMEA),4,Paris,+33 14 723 4404,43 Rue Jouffroy Dabbans,None,None,France,75017,EMEA

In [13]:
session.close()

## Constructing the function

Now we build the functional portion of our code

We first validate a stand alone function, then add to EmployeeResource object (i.e. 'class')

In [14]:
# Validating Function, will extend from session so we don't need to general too much

def getOffices(_firstName, _lastName):
        
        _query = session.query(Employees, Offices)\
            .join(Offices, Employees.officecode == Offices.officecode)\
            .filter(Employees.firstName == _firstName)\
            .filter(Employees.lastName == _lastName)\
            .with_labels()\
            .statement
            
        _empOfficesDf = pd.read_sql(_query, session.bind)
        
        return _empOfficesDf

In [15]:
session = Session()

In [16]:
getOffices("Diane","Murphy")

,employees_officeCode,employees_employeeNumber,employees_lastName,employees_firstName,employees_extension,employees_email,employees_reportsTo,employees_jobTitle,offices_officeCode,offices_city,offices_phone,offices_addressLine1,offices_addressLine2,offices_state,offices_country,offices_postalCode,offices_territory
0,1,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,None,President,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA

In [17]:
# Creating new combined class to fulfil our business case

## Testing relationship mapping
class EmployeeResource:
    
    import pandas as pd
    
    def __init__(self, session):
        self.session = session
        
    def getOffices(self, _firstName,_lastName):
        
        _query = self.session.query(Employees, Offices)\
            .join(Offices, Employees.officecode == Offices.officecode)\
            .filter(Employees.firstName == _firstName)\
            .filter(Employees.lastName == _lastName)\
            .with_labels()\
            .statement
            
        _empOfficesDf = pd.read_sql(_query, session.bind)
        
        return _empOfficesDf

In [19]:
# Create employee resource session object
er = EmployeeResource(session)

# Make input as proxy for user interface

_firstName = raw_input("Employee First Name: ")
_lastName = raw_input("Employee Last Name: ")

df = er.getOffices(_firstName,_lastName)
df

Employee First Name: Diane
Employee Last Name: Murphy

,employees_officeCode,employees_employeeNumber,employees_lastName,employees_firstName,employees_extension,employees_email,employees_reportsTo,employees_jobTitle,offices_officeCode,offices_city,offices_phone,offices_addressLine1,offices_addressLine2,offices_state,offices_country,offices_postalCode,offices_territory
0,1,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,None,President,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA

In [ ]:
session.close()

## Additional Questions to Consider

* How can we extend our functionality?
* Did we fulfill all acceptance criteria?
* How will users interact with this solution?
...

# Appendix: Mapping Syntax, not optimal

DO NOT USE THIS FORM

Included for reference as older information will refer to this format instead

In [93]:
# Mapping is no longer the accepted version, disregard this format

from sqlalchemy.orm import Session
from sqlalchemy.orm import sessionmaker
from sqlalchemy import *
import mysql.connector as sql


dburi = "mysql+mysqlconnector://admin:admin@127.0.0.1:3306/classicmodels" #mysql
#dburi = "sqlite:///classicmodels.db" #sqlite

engine = create_engine(dburi)

#Use existing schema for demostration, define classes in practice

metadata = MetaData()

metadata.reflect(bind=engine, only=['employees','offices'])

In [95]:
offices = Table('offices', metadata,\
               officecode = Column('officeCode', Integer, primary_key = True),\
               autoload = True)

In [98]:
# Defining Foreign Key is an operation which creates a relationship, 

employees = Table('employees', metadata,\
               officecode = Column('officeCode', Integer, ForeignKey('offices.officecode')),\
               autoload = True)

In [103]:
for table in metadata.tables.values():
    print(table.name)
    for column in table.c:
        print(column.name)

employees
employeeNumber
lastName
firstName
extension
email
officeCode
reportsTo
jobTitle
offices
officeCode
city
phone
addressLine1
addressLine2
state
country
postalCode
territory